# Taps
tap 'adoptopenjdk/openjdk'
tap 'aws/tap'
tap 'colindean/fonts-nonfree'
tap 'golangci/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'mongodb/brew'
tap 'neovim/neovim'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'findutils'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnupg'
brew 'grep'
brew 'moreutils'
brew 'neovim'
brew 'nmap'
brew 'mas' # Mac App Store manager
brew 'p7zip'
brew 'ssh-copy-id'
brew 'tmux'

# Development
brew 'composer'
brew 'go'
brew 'golangci-lint'
brew 'imagemagick'
brew 'jenv'
brew 'jq'
brew 'libmemcached'
brew 'nvm'
brew 'pyenv'
brew 'terraform'

# Apps
cask '1password'
cask 'brave-browser'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'keka'
cask 'iterm2'
cask 'postman'
cask 'rambox'
cask 'rar'
cask 'rectangle'
cask 'steam'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
cask 'zsa-wally'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-arial'
cask 'font-cascadia-code'
cask 'font-hack'
cask 'font-ibm-plex'
cask 'font-ibm-plex-mono'
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-microsoft-office'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
