# Taps
tap 'apple/apple'
tap 'beeftornado/rmtree'
tap 'benjiwolff/neovim-nightly'
tap 'colindean/fonts-nonfree'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'homebrew-ffmpeg/ffmpeg'
tap 'lifepillar/appleii'

# Binaries
brew 'alt-tab'
# brew 'bash' # Latest Bash version
brew 'bat' # bat is not cat
brew 'bat-extras' # bat is not cat
brew 'clipy' # bat is not cat
brew 'coreutils' # Those that come with macOS are outdated
brew 'eza' # Replaces ls - so much better
brew 'fd' # Alternate find for lunarvim
brew 'findutils'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
# brew 'grep'
brew 'homebrew-ffmpeg/ffmpeg/ffmpeg'
# brew 'java'
brew 'lazygit'
brew 'moreutils'
# brew 'neovim'
brew 'nmap'
brew 'mas' # Mac App Store manager
brew 'p7zip'
brew 'powerlevel10k'
brew 'ripgrep'
brew 'ssh-copy-id'
brew 'the_silver_searcher' # Needed for fzf for vim
brew 'tree'
brew 'usage'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-fast-syntax-highlighting'
brew 'zsh-system-clipboard'
brew 'zsh-vi-mode'

# Apps
cask '1password'
cask '1password-cli'
cask 'bit-slicer'
cask 'brave-browser'
cask 'ferdium'
cask 'freetube'
cask 'gimp'
cask 'jordanbaird-ice'
cask 'keka'
cask 'kekaexternalhelper'
cask 'keycastr'
cask 'lulu'
# cask 'onyx'
cask 'neovim-nightly'
cask 'rar'
cask 'rectangle'
cask 'stats'
cask 'transmission'
cask 'tunnelblick'
# cask 'vial'
cask 'vlc'
cask 'wezterm'
# Apps that need passwords
cask 'caldigit-docking-utility'
cask 'caldigit-thunderbolt-charging'
cask 'karabiner-elements'
cask 'logitech-camera-settings'
cask 'zoom'

# Games
cask 'crossover'
brew 'dosbox-staging'
cask 'porting-kit'
cask 'steam'

# Fonts
cask 'font-arial'
# cask 'font-cascadia-code'
# cask 'font-hack-nerd-font'
# cask 'font-fira-code-nerd-font'
# cask 'font-ibm-plex'
# cask 'font-ibm-plex-mono'
# cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
# cask 'font-lato'
cask 'font-meslo-lg-nerd-font'
cask 'font-microsoft-office'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
