# Taps
tap 'adoptopenjdk/openjdk'
tap 'aws/tap'
tap 'golangci/tap'
tap 'mongodb/brew'
tap 'neovim/neovim'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bat'
# brew 'gnupg'
brew 'mise'
brew 'neovim'
brew 'python'
brew 'ripgrep' # Needed for telescope-fzf for vim
brew 'shfmt' # Needed for LSP bash for vim
brew 'svn' # Needed for the custom fonts later
brew 'tmux'
# brew 'tmuxinator'
brew 'usage'

# Development
brew 'bazelisk'
brew 'colima' # docker replacement
brew 'composer'
brew 'docker' # docker replacement
brew 'docker-buildx'
brew 'docker-completion'
brew 'docker-compose'
brew 'docker-credential-helper'
brew 'gh'
# brew 'gitui'
brew 'git-delta'
brew 'git-lfs'
brew 'golangci-lint'
brew 'hadolint' # dockerfile lint
brew 'helm'
brew 'imagemagick'
brew 'jq'
brew 'k9s'
brew 'kcat'
brew 'lazygit'
brew 'luarocks' # for lua on vim
brew 'markdownlint-cli' # for markdown for vim
brew 'ruff'
brew 'rust'
brew 'vale' # for markdown for vim
brew 'yq'

# Apps
# cask 'docker'
# cask 'firefox'
# cask 'google-chrome'
# cask 'postman'
# cask 'temurin8'
cask 'goland'
# cask 'pycharm-ce'
cask 'visual-studio-code'
# cask 'zsa-wally' # For my ergodox keyboard

