# Taps
tap 'colindean/fonts-nonfree'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

# Binaries
# brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'exa' # Replaces ls - so much better
brew 'fd' # Alternate find for lunarvim
brew 'findutils'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
brew 'grep'
brew 'moreutils'
brew 'neovim'
brew 'nmap'
brew 'mas' # Mac App Store manager
brew 'p7zip'
brew 'ssh-copy-id'
brew 'the_silver_searcher' # Needed for fzf for vim

# Apps
cask '1password'
cask 'brave-browser'
cask 'keka'
cask 'iterm2'
cask 'rambox'
cask 'rar'
cask 'rectangle'
cask 'vlc'
cask 'zoom'

# Games
brew 'dosbox-staging'
cask 'steam'

# Fonts
cask 'font-arial'
cask 'font-cascadia-code'
cask 'font-hack-nerd-font'
cask 'font-fira-code-nerd-font'
# cask 'font-ibm-plex'
# cask 'font-ibm-plex-mono'
# cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
# cask 'font-lato'
cask 'font-meslo-lg-nerd-font'
cask 'font-microsoft-office'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825

