#kekaexternalhelper Taps
tap 'colindean/fonts-nonfree'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

# Binaries
# brew 'bash' # Latest Bash version
brew 'bat' # bat is not cat
brew 'coreutils' # Those that come with macOS are outdated
brew 'eza' # Replaces ls - so much better
# brew 'fd' # Alternate find for lunarvim
brew 'findutils'
brew 'fzf'
brew 'git'
brew 'git-lfed'
brew 'git-lfs'
brew 'gnu-sed'
brew 'grep'
brew 'java'
brew 'moreutils'
brew 'neovim'
brew 'nmap'
brew 'mas' # Mac App Store manager
brew 'p7zip'
brew 'powerlevel10k'
brew 'ripgrep'
brew 'ssh-copy-id'
brew 'the_silver_searcher' # Needed for fzf for vim
brew 'tree'
brew 'usage'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-vi-mode'

# Apps
cask '1password'
cask '1password-cli'
cask 'bit-slicer'
cask 'brave-browser'
cask 'caldigit-docking-utility'
cask 'caldigit-thunderbolt-charging'
cask 'ferdium'
cask 'freetube'
cask 'gimp'
cask 'karabiner-elements'
cask 'keka'
cask 'kekaexternalhelper'
cask 'keycastr'
cask 'logitech-camera-settings'
# cask 'onyx'
cask 'rar'
cask 'rectangle'
cask 'stats'
cask 'transmission'
cask 'tunnelblick'
cask 'vial'
cask 'vlc'
cask 'wezterm'
cask 'zoom'

# Games
brew 'dosbox-staging'
cask 'porting-kit'
cask 'steam'

# Fonts
cask 'font-arial'
# cask 'font-cascadia-code'
# cask 'font-hack-nerd-font'
# cask 'font-fira-code-nerd-font'
# cask 'font-ibm-plex'
# cask 'font-ibm-plex-mono'
# cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
# cask 'font-lato'
cask 'font-meslo-lg-nerd-font'
cask 'font-microsoft-office'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825


yq
z3
zbar
zookeeper
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
zsh-vi-mode
zstd
1password
1password-cli
amazon-chime
bit-slicer
brave-browser
caldigit-docking-utility
caldigit-thunderbolt-charging
chromedriver
ferdium
font-arial
font-jetbrains-mono-nerd-font
font-meslo-lg-nerd-font
font-microsoft-office
freetube
gimp
goland
imhex
karabiner-elements
keka
kekaexternalhelper
keycastr
logitech-camera-settings
porting-kit
qmk-toolbox
rar
rectangle
retroarch
stats
temurin8
temurin@8
vial
visual-studio-code
vlc
wezterm
zoom
