# Taps
tap 'adoptopenjdk/openjdk'
tap 'aws/tap'
tap 'golangci/tap'
tap 'homebrew/cask-versions'
tap 'mongodb/brew'
tap 'neovim/neovim'
tap 'nicoverbruggen/homebrew-cask'
tap 'syncdk/aws-session-manager-plugin'

# Binaries
brew 'asdf'
brew 'awscli'
brew 'aws-session-manager-plugin'
brew 'aws-vault'
brew 'code-minimap' # Needed for neovim minimap
brew 'colima' # docker replacement
brew 'docker' # docker replacement
brew 'gnupg'
brew 'neovim'
brew 'python'
brew 'ripgrep' # Needed for telescope-fzf for vim
brew 'shfmt' # Needed for LSP bash for vim
brew 'svn' # Needed for the custom fonts later
brew 'tmux'
# brew 'tmuxinator'

# Development
brew 'bazelisk'
brew 'cargo'
brew 'colima'
brew 'composer'
brew 'docker-credential-helper'
brew 'gitui'
brew 'golangci-lint'
brew 'hadolint' # dockerfile lint
brew 'imagemagick'
brew 'jq'
brew 'keycastr'
brew 'libmemcached'
brew 'luarocks' # for lua on vim
brew 'markdownlint-cli' # for markdown for vim
brew 'rust'
brew 'vale' # for markdown for vim

# Apps
# cask 'docker'
# cask 'firefox'
# cask 'google-chrome'
# cask 'postman'
cask 'adoptopenjdk/openjdk/adoptopenjdk8'
# cask 'pycharm-ce'
cask 'visual-studio-code'
cask 'zsa-wally' # For my ergodox keyboard

