# Taps
tap 'adoptopenjdk/openjdk'
tap 'aws/tap'
tap 'colindean/fonts-nonfree'
tap 'golangci/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'mongodb/brew'
tap 'neovim/neovim'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'code-minimap' # Needed for neovim minimap
brew 'colima' # docker replacement
brew 'coreutils' # Those that come with macOS are outdated
brew 'exa' # Replaces ls - so much better
brew 'fd' # Alternate find for lunarvim
brew 'findutils'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnupg'
brew 'grep'
brew 'moreutils'
brew 'neovim'
brew 'nmap'
brew 'mas' # Mac App Store manager
brew 'p7zip'
brew 'python'
brew 'ripgrep' # Needed for telescope-fzf for vim
brew 'shfmt' # Needed for LSP bash for vim
brew 'ssh-copy-id'
brew 'svn' # Needed for the custom fonts later
brew 'the_silver_searcher' # Needed for fzf for vim
brew 'tmux'
# brew 'tmuxinator'

# Development
brew 'bazelisk'
brew 'cargo'
brew 'composer'
brew 'colima'
brew 'docker-credential-helper'
brew 'go'
brew 'golangci-lint'
brew 'hadolint' # dockerfile lint
brew 'imagemagick'
brew 'jenv'
brew 'jq'
brew 'lazygit'
brew 'libmemcached'
brew 'luarocks' # for lua on vim
brew 'markdownlint-cli' # for markdown for vim
brew 'nvm'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rust'
brew 'tfenv'
brew 'vale' # for markdown for vim

# Apps
cask '1password'
cask 'brave-browser'
cask 'docker'
# cask 'firefox'
# cask 'google-chrome'
cask 'keka'
cask 'iterm2'
cask 'postman'
cask 'rambox'
cask 'rar'
cask 'rectangle'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
cask 'zsa-wally' # For my ergodox keyboard

# Games
brew 'dosbox-staging'
cask 'steam'

# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'

# Fonts
cask 'font-arial'
cask 'font-cascadia-code'
cask 'font-hack-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-ibm-plex'
cask 'font-ibm-plex-mono'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
# cask 'font-lato'
cask 'font-microsoft-office'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825

# 
